tutorials/myLusgsFoam/GAMM-40/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v1912                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

5
(
    emptyPlanes
    {
        type            empty;
        inGroups        1(empty);
        nFaces          15000;
        startFace       14800;
    }
    lowerWall
    {
        type            wall;
        inGroups        1(wall);
        nFaces          150;
        startFace       29800;
    }
    upperWall
    {
        type            wall;
        inGroups        1(wall);
        nFaces          150;
        startFace       29950;
    }
    inlet
    {
        type            patch;
        nFaces          50;
        startFace       30100;
    }
    outlet
    {
        type            patch;
        nFaces          50;
        startFace       30150;
    }
)

// ************************************************************************* //
